In [10]:
import pandas as pd

In [11]:
match=pd.read_excel('match.xlsx')
source=match.reindex(columns=['source','type1'])
source

                        source    type1
0           bu./course/college   string
1           bu./course/college   string
2           bu./course/college   string
3           bu./course/college   string
4           bu./course/college   string
...                        ...      ...
997   fsu./Course/Section/#agg  integer
998   fsu./Course/Section/#agg  integer
999   fsu./Course/Section/#agg  integer
1000  fsu./Course/Section/#agg  integer
1001  fsu./Course/Section/#agg  integer

[1002 rows x 2 columns]

In [19]:
source=source.drop_duplicates()

source=source.rename(columns={'source':'column','type1':'type'})
source

                                  column     type
0                     bu./course/college   string
5            bu./course/courseInfo/@code   string
10      bu./course/courseInfo/instructor   string
15   bu./course/courseInfo/schedule/days     date
20   bu./course/courseInfo/schedule/room   string
..                                   ...      ...
977    fsu./Course/Detail/SeatsOpen/#agg  integer
982             fsu./Course/Detail/Title   string
987              fsu./Course/ReferenceNo   string
992                  fsu./Course/Section  integer
997             fsu./Course/Section/#agg  integer

[123 rows x 2 columns]

In [20]:
target=match.reindex(columns=['target','type2'])
target=target.drop_duplicates()
target=target.rename(columns={'target':'column','type2':'type'})
target

                          column    type
0          arizona./Course/@Code  string
1            arizona./Course/Day    date
2     arizona./Course/Instructor  string
3          arizona./Course/Place  string
4           arizona./Course/Time    time
..                           ...     ...
863  stanford./Course/CourseCode  string
864  stanford./Course/CourseName  string
865     stanford./Course/DayTime    time
866  stanford./Course/Instructor  string
867        stanford./Course/Room  string

[90 rows x 2 columns]

In [15]:
len(target[target['type2']=='string'])+len(source[source['type1']=='string'])

149

In [16]:
90+123

213

In [17]:
149/213

0.6995305164319249

In [24]:
fin=pd.concat([source,target]).drop_duplicates()

In [25]:
len(fin[fin['type']=='string'])/167

0.7005988023952096

In [27]:
(len(fin[fin['type']=='date'])+len(fin[fin['type']=='time']))/167

0.1437125748502994

In [28]:
(len(fin[fin['type']=='integer']))/167

0.15568862275449102

In [33]:
pd.set_option('display.max_rows',200)
len(fin)

167

In [35]:
sum(match['label'])

52